---
kind: type
id: T:Autodesk.Revit.DB.SpatialElementBoundaryOptions
source: html/ee293124-138d-142d-9ced-9695bc8b8c2e.htm
---
# Autodesk.Revit.DB.SpatialElementBoundaryOptions

Options that can be passed to a SpatialElementBoundaryCalculator to influence the results of the calculation.

## Syntax (C#)
```csharp
public class SpatialElementBoundaryOptions : IDisposable
```